// Хэрэглэгч нууц үгээ мартсан тул шинээр сольж байгаа бөгөөд шинэ нууц үгээ давтан оруулж 2 нууц үг хоорондоо ижил бичсэн байна уу шалгаж баталгаажуулах хэрэгтэй.
// Гараас newPassword, confirmNewPassword гэсэн 2 хувьсагчинд утга авна.
// Нууц үгүүд хоорондоо ижил байвал => "Нууц үг амжилттай солигдлоо" гэж хэвлэнэ.
// Нууц үгүүд хоорондоо таарахгүй байвал => "Нууц үгээ зөв давтаж оруулаарай" гэж хэвлэнэ.

function hello() {
  newPassword = prompt("Та шинэ нууц үгээ оруулна уу?");
  confirmNewPassword = prompt("Та шинэ нууц үгээ ахин оруулна уу?");

  if (newPassword == confirmNewPassword) {
    document.getElementById("demo").innerHTML = "Нууц үг амжилттай солигдлоо";
  } else {
    document.getElementById("demo").innerHTML =
      "Нууц үгээ зөв давтаж оруулаарай";
  }
}
